# FamilyRotateTextWithComponent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyRotateTextWithComponent Property
ParameterTypeId Class See Also
---
"Rotate text with component"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyRotateTextWithComponent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyRotateTextWithComponent As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyRotateTextWithComponent {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace